[
    {
        "id": "featured-project-mlops",
        "title": "MLOps Pipeline: End-to-End ML System with Cloud Deployment",
        "year": "June 2024 - July 2024",
        "location": "Machine Learning",
        "tags": ["Python", "MLflow", "AWS", "Docker", "Scikit-learn", "NumPy"],
        "description": "Architected an end-to-end MLOps pipeline using MLflow and custom components, implementing automated data processing and model training workflows that reduced experiment tracking time by 60% while maintaining 95% reproducibility across deployments. Engineered CI/CD pipeline using GitHub Actions for ML model deployment to AWS EC2, containerizing the application with Docker and implementing automated testing, resulting in 40% faster deployment cycles and 99.9% system uptime.",
        "image": "/portfolio/assets/featured-projects/mlops.webp",
        "jpg": "/portfolio/assets/featured-projects/mlops.jpeg"
    },
    {
        "id": "featured-project-llmb",
        "title": "LLM Based Q&A System for Scalable E-Learning Support",
        "year": "May 2024 - June 2024",
        "location": "Large Language Models",
        "tags": [
            "LangChain",
            "Google PaLM",
            "Hugging Face",
            "Python"
        ],
        "description": "Developed a scalable AI-driven Q&A platform powered by LangChain and Google PaLM, automating support for 180,000+ students, reducing query resolution time by 90% and handling 1,000+ inquiries daily. Enhanced query resolution accuracy to 95% by implementing vector similarity search with FAISS and Hugging Face embeddings, reducing manual intervention by 80% across 20,000+ student support cases.",
        "image": "/portfolio/assets/featured-projects/llmb.webp",
        "jpg": "/portfolio/assets/featured-projects/llmb.png"
    },
    {
        "id": "featured-project-cricket",
        "year": "May 2024 - June 2024",
        "location": "Data Analytics",
        "title": "T20 Cricket Analytics Dashboard for Optimized Player Selection",
        "tags": ["Python", "PowerBI"],
        "description": "Built a cricket analytics platform using Python and Power BI to evaluate performance metrics from 45+ T20 World Cup matches, achieving 95% precision in player ranking and team optimization. Automated the extraction of 1,000+ performance statistics from ESPN Cricinfo using Bright Data, reducing manual data processing by 90% and enabling dynamic data visualization in dashboards.",
        "image": "/portfolio/assets/featured-projects/cricket.webp",
        "jpg": "/portfolio/assets/featured-projects/cricket.png"
    },
    {
        "id": "featured-project-fsfa",
        "title": "Full-Stack Finance Analytics Dashboard with ML Predictions",
        "year": "Aug. 2024 - Oct. 2024",
        "location": "Full Stack",
        "tags": [" React.js", "TypeScript", "NodeJS", "Express.js", "Machine Learning"],
        "description": "Designed a full-stack financial analytics dashboard with the MERN stack, Redux Toolkit, and Vite, integrating 6+ interactive charts and real-time KPI tracking, reducing latency for financial data visualization by 40%. Implemented a machine learning-based revenue forecasting module using Regression.js, achieving 85% accuracy from 1,000+ historical financial records, enabling data-driven financial planning",
        "image": "/portfolio/assets/featured-projects/fsfa.webp",
        "jpg": "/portfolio/assets/featured-projects/fsfa.png",
        "github": "https://github.com/theomthakur/QuantDash",
    }
]
